{
  "title": "Job Postings",
  "date": "2019-03-28T21:15:57.000Z",
  "thumbnail": "",
  "body": "- - -\n\n# May 24, 2019\n\n## Process Engineer                              \n\n**Detroit, MI, US**\n\nWe are currently seeking an exceptonal hard working individual to carry out process related tasks at our Detroit headquarters.\n\n**Job Responsibilities**\n\n* Experience in process engineering\n* Invent, develop and implement challengin solutions\n* Prioritise industry sectors, understand OEM's needs (Automotive & non Automtive markets)\n* Create technical solutions to overcome process challenges\n* Assist engineering team to reach a complete conclusion.\n\n**Job Requirements**\n\n* Knowledge of process materials, polymers and polymer foams at teh least.\n* Undertanding of or ability to quickly learn process technolgies in terms of performance, investement, cycle times and cost.\n* Ability to manage project timeline, responsibilities and sign off final processes.\n* CAD literate\n* Comfortable with FEA\n\n\n\n![](/images/uploads/easyapply_med.png)\n\n- - -\n\n## March 28, 2019\n\n## Innovation Manager\n\n**Innovation Centre - Location TBC**\n\nWe are currently seeking an innovation manager to work for us in our brand new exciting Innovation Centre.\n\n**Job Responsibilities**\n\n* Secure ARPRO sales through early involvement in the development of innovative solutions\n* Invent, develop and implement challenging ARPRO solutions, from initial concept to start-of-production\n* Prioritise industry sectors, understand OEM’s needs (Automotive & Non-Automotive markets)\n* Create technical content and evaluate TCO (Total Cost of Ownership) to sell novel concepts to relevant stakeholders\n* Assist Sales in providing material and application specific expertise to optimise overall system performance\n\n**Job Requirements**\n\n* Knowledge of polymers, polymer foams or at least some understanding and the ability to improve knowledge in these topics quickly. \n* Understanding of or ability to quickly learn assembly technologies, in terms of performance, investment, cycle times and cost\n* Ability to manage innovation projects: time-line, responsibilities, process and customer sign-off\n* Interest in: automotive, HVAC or any technical, innovative subject area\n* CAD literate\n* Comfortable with FEA\n* Prepared to challenge conventional system lay-out and thinking\n* Strong interpersonal and communication skills \n* Proficient in English and good conversational German\n* Willingness to travel throughout EMEA (50% of your time)\n* High degree of autonomy\n\n_Interested or you know someone? Please send your CV and cover letter in English to Iris.Ogiejko@jsp.com before 12.06.2019._\n\n![](/images/uploads/easyapply_med.png)\n\n- - -\n\n## June 1, 2019\n\n#### New Features\n\n* Categories\n* \n\n#### Fixes\n\n* Breadcrumb flexbox fix\n* \n\n- - -\n\n## 0.1.1 - Initial Version\n\n* CSS Grid based layout\n* Responsive design\n* Featured Image\n* Blog collection type\n* Page collection type\n* Client-side fuzzy search\n* Newsletter signup Netlify Function\n\n- - -\n\n## Roadmap\n\n~~Add Categories~~\\\n~~Add Pagination~~\\\n~~Page Transitions~~\\\nAdd Tags\\\nLazy Loaded Images"
}