{
  "title": "Job Postings",
  "date": "2019-03-28T21:15:57.000Z",
  "thumbnail": "/images/uploads/main_image.png",
  "body": "- - -\n\n# May 24, 2019\n\n## Process Engineer                              \n\n**Detroit, MI, US**\n\nWe are currently seeking an exceptonal hard working individual to carry out process related tasks at our Detroit headquarters.\n\n**Job Responsibilities**\n\n* Experience in process engineering\n* Invent, develop and implement challengin solutions\n* Prioritise industry sectors, understand OEM's needs (Automotive & non Automtive markets)\n* Create technical solutions to overcome process challenges\n* Assist engineering team to reach a complete conclusion.\n\n**Job Requirements**\n\n* Knowledge of process materials, polymers and polymer foams at teh least.\n* Undertanding of or ability to quickly learn process technolgies in terms of performance, investement, cycle times and cost.\n* Ability to manage project timeline, responsibilities and sign off final processes.\n* CAD literate\n* Comfortable with FEA\n\n\n\n![](/images/uploads/easyapply_med.png)\n\n- - -\n\n## March 28, 2019\n\n## Innovation Manager\n\n**Innovation Centre - Location TBC**\n\nWe are currently seeking an innovation manager to work for us in our brand new exciting Innovation Centre.\n\n**Job Responsibilities**\n\n* Secure ARPRO sales through early involvement in the development of innovative solutions\n* Invent, develop and implement challenging ARPRO solutions, from initial concept to start-of-production\n* Prioritise industry sectors, understand OEM’s needs (Automotive & Non-Automotive markets)\n* Create technical content and evaluate TCO (Total Cost of Ownership) to sell novel concepts to relevant stakeholders\n* Assist Sales in providing material and application specific expertise to optimise overall system performance\n\n**Job Requirements**\n\n* Knowledge of polymers, polymer foams or at least some understanding and the ability to improve knowledge in these topics quickly. \n* Understanding of or ability to quickly learn assembly technologies, in terms of performance, investment, cycle times and cost\n* Ability to manage innovation projects: time-line, responsibilities, process and customer sign-off\n* Interest in: automotive, HVAC or any technical, innovative subject area\n* CAD literate\n* Comfortable with FEA\n* Prepared to challenge conventional system lay-out and thinking\n* Strong interpersonal and communication skills \n* Proficient in English and good conversational German\n* Willingness to travel throughout EMEA (50% of your time)\n* High degree of autonomy\n\n_Interested or you know someone? Please send your CV and cover letter in English to Iris.Ogiejko@jsp.com before 12.06.2019._\n\n![](/images/uploads/easyapply_med.png)\n\n- - -\n\n## June 1, 2019\n\n# Process Manager\n\n## Location Europe. City to be decided\n\n**Job Responsibilities**\n\n* Manage the EMEA team, apply exemplary and honest leadership in line with our strategy and our values, including ONE JSP.\n* Develop and implement sustainable production processes and technology to decrease CoP; optimise recycling (utilities and material) and minimise environmental impacts.\n* Ensure efficient process (product availability at exemplary quality and consistency).\n* Ensure safe and secured processes in Cheb and Estrées with equivalent operating procedures.\n* Provide and use tools, techniques and share knowledge to ease the operations. Analyse performance, report, drive continuous improvements.\n\n**Job Requirements**\n\n* Good knowledge in ARPRO processing \n* Knowledge’s in polymers processing (extrusion, injection molding, foaming)\n* The ability to lead and motivate a team and spread ONE JSP\n* The ability to eliminate complexity, to be clear and brief\n* Flexibility, self-confidence, persistence and initiative \n* Excellent planning, organisational and analytical skills \n* The ability to work on EMEA projects (cross functional)\n\n_Fluent in English_\n\nWillingness to travel in Europe\n\n_Interested or you know someone? Please send your CV and cover letter in English to cassandre.jardin@jsp.com no later than 05.06.2019_\n\n![](/images/uploads/easyapply_med.png)\n\n- - -\n\n## May 13, 2019\n\n# Shift leader\n\n## Location: Estrees St Denis, France\n\n**Job Responsibilities**\n\n_The mission of the Shift Leader will be:_\n\n* Exemplary strong, dynamic, honest leadership in line with our strategy and our values\n* Manage ARPRO production (quality, efficiency, issue analysis report)\n* Motivate and make the people growing following Job ladder\n* Promote ONE JSP and EMEA exchanges\n* Make clear and brief report/recommendation\n* Be a driving force to improve internal processes that will lead to more efficiency and flexibility\n* Be actively involved in 5S and responsible for a safe and secure working environment\n\n**Job Requirements**\n\n_To be successful in the role you will have:_\n\n* An open and positive mind\n*  Excellent planning, organisational and analytical skills\n* A proactive approach, business focus and drive\n* Flexibility, self-confidence, persistence and initiative \n* The ability to deliver excellence and demand it of others\n* The ability to make people grow\n* A kodawari warrior mind\n* A good English level\n\n_Interested or you know someone? Please send your CV and cover letter in English to Cassandre Jardin – cassandre.jardin@jsp.com no later than 31.05.2019._\n\n![](/images/uploads/easyapply_med.png)\n\n- - -\n\n##"
}